app/views/messages/index.html.erb

          <big>To: &nbsp</big>
          <% if User.find_by_id(msg.receiver_id).image.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]