app/views/tweets/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
        <div class="col-xs-2">
          <%= image_tag(User.find_by(id: tweet.user_id).image, class: "protrait")%>

SELECT  "users".* FROM "users" WHERE (1) LIMIT 1
---

              <% if Follow.find_by(fan_id: session["user_id"], star_id: tweet.user_id).present? %>

SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  ORDER BY date desc  [["tweet_id", 5]]
---
        <div id="comment_of_<%= tweet.id %>"></div>
        <% comments = Comment.where(tweet_id: tweet.id).order('date desc') %>

SELECT COUNT(*) FROM "follows" WHERE "follows"."fan_id" = ?  [["fan_id", 3]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
---
        <div class="col-xs-2">
          <%= Follow.where(fan_id: session["user_id"]).count%><br>
          <%= Follow.where(star_id: session["user_id"]).count%><br>
          <%= Tweet.where(user_id: session["user_id"]).count%><br>