app/controllers/follows_controller.rb

	def index
		@user = User.find_by(:id => params["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]