app/controllers/messages_controller.rb

	def index
		@user = User.find_by_id(session["user_id"])
		if params["user_id"].present?
			@messages = Message.where(sender_id: params["user_id"])
			@messages_in = Message.where(receiver_id: session["user_id"])
		end
		@messages = @messages.order('date desc').paginate(:per_page => 5, :page => params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "messages".* FROM "messages" WHERE "messages"."sender_id" = ?  ORDER BY date desc LIMIT 5 OFFSET 0  [["sender_id", 4]]

	def create
		message = Message.new
		if User.find_by_username(params[:receiver]).present?
			message.receiver_id = User.find_by_username(params[:receiver]).id
			message.content = params[:message]
			message.date = DateTime.now.to_i
			message.sender_id = session["user_id"]
			message.is_read = false
			message.save
---
INSERT INTO "messages" ("receiver_id", "content", "date", "sender_id") VALUES (?, ?, ?, ?)  [["receiver_id", 0], ["content", "how are you?"], ["date", 1432965441], ["sender_id", 4]]