app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 7]]
---
	def destroy
		Tweet.find_by(id: params["id"]).delete

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 5]]
---
	def update
		tweet = Tweet.find_by(id: params["id"])