app/controllers/users_controller.rb

	def create
		@user = User.new(username: params[:username], email: params[:email], password: params[:password])
		if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest") VALUES (?, ?, ?)  [["username", "haouc"], ["email", "hzhoucs@gmail.com"], ["password_digest", "$2a$10$Js1z2O9BLeAVwFX7027/IOicpzV1EG.QNTVdKbERYw6sddyjG5j92"]]

	def update

		@user = User.find_by(id: params[:id])
		@user.username = params[:username]
		@user.email = params[:email]
		@user.image = params[:image]

		if params[:password] == params[:repassword]
			@user.password = params[:password]
			if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "image" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["image", "http://www.debacleent.com/wp-content/uploads/2013/08/chicago_bulls_png.png"], ["password_digest", "$2a$10$gvh6RD9eF4uT/GgoYEvzDeWyK.EBJYqPiXOS1WW5sgiu6Ir0smVe2"], ["id", 4]]